updated architecture diagram
